#include <stdio.h>
#include <stdlib.h>
#include <math.h>

/*
	二维数组(矩阵计算)(多维数组)
	二维数组的本质，也是一维数组，只不过，一维数组中的每个元素，又是一个一维数组而己。
	二维是一种逻辑概念，也就是说逻辑上来说二维的，是行列矩阵。
	但它在内存中的存储却是一维的， 按行顺序存储(重要)。
	flaot arr[3][4]; arr[m][n] mxn个元素，m行n列  从[0][0]~[m-1][n-1]

	逻辑形式：

	[0][0] [0][1] [0][2] [0][3]
	——————————————————————————>
	[1][0] [1][1] [1][2] [1][3]
	——————————————————————————>
	[2][0] [2][1] [2][2] [2][3]  
	——————————————————————————>
	
	内存中存储形式：
				^
	a[2][3]   	|
	a[2][2]     |
	a[2][1]		|
	a[2][0]		|
	a[1][3]		|
	a[1][2]		|
	a[1][1]		|
	a[1][0]		|
	a[0][3]		|
	a[0][2]		|
	a[0][1]		|
	a[0][0]		|
	
	知道 &a[0][0]的地址，数组的地址都知道
	arr数组名是首元素arr[0]
	
*/

int main()
{
	
#if 0
	int arr[3][4]; // int[4] int array[3];
	//成员的大小
	printf("sizeof(arr[0]) = %d sizeof(int[4])= %d\n",
		sizeof(arr[0]),sizeof(int[4]));
	//数组的大小
	printf("sizeof(arr) = %d\n",sizeof(arr));
	return 0;
#endif
	
/*
	初始化注意的部分
	(1)C 语言不进行越界型检查
	(2)定义数组时 行可以省，列不可以省，列里面有类型信息(一维数组的类型)
	(3)部分初始化，未初始化，默认置0
	
	//
	int a[3][4]; // 未初始化   (只定义)
	int a[3][4] = {{1,2,3,4},{1,2,3,4},{1,2,3,4}}; //全初始化 (全部元素都赋予初始值)
	int a[3][4] = {{1},{1,2},{1,2,3}}; //行部分初始化(行的元素没有确定的元素都设置为0)
	int a[3][4] = {11,22,33,44,55}; //全局部分初始化(数组是连续的，分配好已知的元素，其余元素都设置为0)
	int a[3][4] = {{1,2,3,4},{1,2,3,4},{1,2,3,4},{1,2,3,4}};//显然是4行4列 16个元素
	//满初始化 (超出设置的元素，arr[3][4] 3x4个元素，3行4列  )
	int a[][4] = {{1,2,3,4},{1,2,3,4},{1,2,3,4},{1,2,3,4}}; ====>>列不可以省
	//省行初始化  (行可以省，列不可以省，列里面有类型信息(一维数组的类型))
	
*/
#if 0
	 int a[3][4] = {{1,2,3,4},{1,2,3,4},{1,2,3,4},{1,2,3,4}}; //满初始化 
	 //C 语言不进行越界型检查
	 for(int i=0; i<3; i++)
	 {
		 for(int j=0; j<4; j++)
		 {
			 printf("a[%d][%d] = %4d\t",i,j,a[i][j]);
		 }
		 putchar(10);
	 }
#endif
	 
#if 0
	 
#endif

	 
#if 0
	int a[3][4] = {{1,2,3,4},{1,2,3,4},{1,2,3,4}}; //全初始化
	//此处大括号中不加大括号也是正确的，但有警告
	for(int i=0; i<3; i++)
	{
		for(int j=0; j<4; j++)
		{
			printf("a[%d][%d] = %4d\t",i,j,a[i][j]);
		}
		putchar(10);
	}

#endif
	  
#if 0
	 int a[3][4] = {{1},{1,2},{1,2,3}}; //行部分初始化
	 //未初始化的部分清零
	 for(int i=0; i<3; i++)
	 {
		 for(int j=0; j<4; j++)
		 {
			 printf("a[%d][%d] = %4d\t",i,j,a[i][j]);
		 }
		 putchar(10);
	 }

#endif
	 
#if 0	 
	 int a[][4] = {{1,2,3,4},{1,2,3,4},{1,2,3,4},{1,2,3,4}}; //省行初始化
	 //行可以省，列不可以省，列里面有类型信息(一维数组的类型)
	 for(int i=0; i<sizeof(a)/sizeof(a[0]); i++)
	 {
		 for(int j=0; j<4; j++)
		 {
			 printf("a[%d][%d] = %4d\t",i,j,a[i][j]);
		 }
		 putchar(10);
	 }
#endif	
	 
	 
	 /*
		 多维数组中数组成员的访问(for循环)
	 */
}
